/*
 * The C source code was RESTORED by disassembling the original executable
 * file OBJTOHEX.COM from the Hi-Tech v3.09 compiler. 
 *
 * Not a commercial goal of this laborious work is to popularize among
 * potential fans of 8-bit computers the old HI-TECH C compiler V3.09
 * (HI-TECH Software) and extend its life, outside of the CP/M environment
 * (Digital Research, Inc), for full operation in a  Unix-like operating
 * system UZI-180 without using the CP/M emulator.
 *
 * The HI-TECH C compiler V3.09 is provided free of charge for any use,
 * private or commercial, strictly as-is. No warranty or product support
 * is offered or implied including merchantability, fitness for a particular
 * purpose, or non-infringement. In no event will HI-TECH Software or its
 * corporate affiliates be liable for any direct or indirect damages.
 *
 * You may use this software for whatever you like, providing you acknowledge
 * that the copyright to this software remains with HI-TECH Software and its
 * corporate affiliates.
 *
 * All copyrights to the algorithms used, binary code, trademarks, etc.
 * belong to the legal owner - Microchip Technology Inc. and its subsidiaries.
 * Commercial use and distribution of recreated source codes without permission
 * from the copyright holderis strictly prohibited.
 *
 *	Mark Ogden	20.08.2022
 */

#include <ctype.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#ifdef _MSC_VER
#include <io.h>
#else
#include <fcntl.h>
#include <unistd.h>
#endif

uint8_t order32[4] = { 0, 1, 2, 3 };	/* 5a61 */
uint8_t order16[2] = { 0, 1 };		/* 5a65 */

struct {
    char *name;
    long val;
} marker[] = {
    { "__Htext",  0 },	/* 0 */
    { "__Hdata",  0 },	/* 1 */
    { "__Hbss",   0 },	/* 2 */
    { "__Ldata",  0 },	/* 3 */
    { "__Hstack", 0 },	/* 4 */
    { "__Bstack", 0 },	/* 5 */
    { "__Bdata",  0 },	/* 6 */
    { "__H_TEXT", 0 }	/* 7 */
};

char    *objFile       = "l.obj";	/* 5bac */
char    *hexFile       = "l.hex";	/* 5bae */
char    *relocSegName  = "__Lbss";	/* 5bb0 */
char     relocTmp[]    = "reloc.$$$";	/* 5bb2 */
char     sym1[]        = "sym1.$$$";	/* 5bbc */
char     sym2[]        = "sym2.$$$";	/* 5bc5 */
char     swap[]        = "swap.$$$";	/* 5bce */

/* Accessors for above */

#define Htext  marker[0].val
#define Hdata  marker[1].val
#define Hbss   marker[2].val
#define Ldata  marker[3].val
#define Hstack marker[4].val
#define Bstack marker[5].val
#define Bdata  marker[6].val
#define H_text marker[7].val

uint8_t  b6039[9];			/* 6039 */
long     dw6042;			/* 6042 */
bool     blkLoaded[256];		/* 6046 */
bool     sOpt;				/* 6146 */

struct {
    unsigned int addr1;
    unsigned int addr2;
    unsigned int where1;
    unsigned int where2;
    unsigned int offset;
} chkSumList[64];

bool     b63C7;				/* 63c7 */
long     dw63C8;			/* 63c8 */
bool     mOpt;				/* 63cc */
uint32_t _Htext;			/* 63cd */
FILE    *symFp;				/* 63d1 */
bool     lOpt;				/* 63d3 */
bool     b63D4;				/* 63d4 */
char    *progname;			/* 63d5 */
bool     aOpt;				/* 63d7 */
int16_t  w63D8;				/* 63d8 */
FILE    *relocFp;			/* 63da */
uint8_t  w63DC[28];			/* 63dc */
char    *w63F8;				/* 63f8 */
uint8_t *blkBuf[256];
uint16_t extSegment;
long     imageOffset;
uint32_t _Ltext;
bool     hOpt;				/* 6604 */
uint8_t  b6605[128 - 9 - 9];		/* 6605 */
bool     binaryImage;			/* 6673 */
int16_t  w6674;				/* 6674 */
bool     iOpt;				/* 6676 */
bool     cOpt;				/* 6677 */
uint8_t  r6678[10];			/* 6678 */
long     startAddr;
bool     hasOffset;
uint8_t  recType;
uint16_t recLen;
long     dw668A;			/* 668a */
int16_t  nreloc;
bool     pOpt;				/* 6690 */
uint8_t  b6691[9];			/* 6691 */
long     wrPos;
long     maxStack;
uint8_t  recData[512 - 3];
int16_t  chkIdx;
uint8_t  b68A1[32];			/* 68a1 */
int16_t  swapFd;			/* 68c1 */
bool     hasReloc;			/* 68c3 */
bool     eOpt;				/* 68c4 */
FILE    *sym2Fp;			/* 68c5 */
bool     rOpt;				/* 68c7 */
uint8_t  exeHdr[512];

/****************************************************************
 * Prototype functions are located in sequence of being in
 * original binary image of OBJTOHEX.COM
 ****************************************************************/
int      main(int argc, char **argv);		/*  1 sub_013d  */
void     sub_DB2(void);				/*  2 sub_DB2	*/
void     doFile(void);				/*  3 		*/
long     sub_10DB(void);			/*  4 sub_10DB	*/
void     sub_1503(void);			/*  5 sub_1503	*/
void     sub_1621(void);			/*  6 sub_1621	*/
void     loadBlk(int16_t blkNum);		/*  		*/
void     u32tob(uint8_t *buf, long n);		/*  		*/
void     i16tob(uint8_t *buf, uint16_t n);	/*  		*/
